<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.1//EN"
	"http://www.w3.org/TR/xhtml11/DTD/xhtml11.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en">
<head>
<title>C&oacute;mo manejar las im&aacute;genes</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link href="../../estilos.css" rel="stylesheet" type="text/css">


</head>

<body class="body-popup">
<table width="100%" border="0" align="center" cellpadding="0" cellspacing="0">
 <tr>
  <td class="td-titulo-popup"><div align="center"><strong>Tips
      para el manejo apropiado de im&aacute;genes web</strong></div></td>
 </tr>
 <tr>
  <td class="td-mensajes1">Este es quizas el m&oacute;dulo de ayuda m&aacute;s importante de todo el sistema. Por favor apague su celular y descon&eacute;ctese del
  msn por 30 minutos y lea esta ayuda lo m&aacute;s detenidamente posible Le ser&aacute; de gran utilidad aprender lo que aqui se expone.</td>
 </tr>
 <tr>
  <td class="span-subtitulo1"><font size="3"><strong>Entendiendo el manejo de archivos
  en su computadora</strong></font></td>
 </tr>
 <tr>
  <td><p><font size="2">1.- Las im&aacute;genes o cualquier archivo que usted
  desee colocar en su Web Site deben tener ciertos par&aacute;metros para su correcta visualizaci&oacute;n y para evitar
  problemas que le ser&aacute;n dif&iacute;ciles de detectar. Procure:</font></p>
  <blockquote>
   <p><font size="2">a.-  NO utilizar&nbsp; <strong>caracteres
   especiales</strong> en los nombres de&nbsp; archivo (#% &acute; ` ?&iquest; &ntilde;, etc)&nbsp; <br>
   b.-
   No dejar <strong>espacios</strong> en los nombres de archivo.<br>
   c.- Tener todo el nombre del archivo en <strong>min&uacute;scula</strong><br>
   d.- <strong>Usar nombres descriptivos y ordenados</strong> que le permitan reconocer su archivo apenas lo vea, sin tener que abrirlo.
   </font><br>
   <font size="2">e.- Usar <strong>siempre un mismo sistema</strong> de nomenclatura para todas las im&aacute;genes de su
   proyecto.</font></p>
  </blockquote>  
  <p align="center"><font size="2">&quot;camisa marr&oacute;n para ni&ntilde;as
  .JPG&quot;&nbsp; <strong><font color="#CC0000">NO<br>
  </font></strong>&quot;camisas-ninas-marron.jpg&quot; <strong>SI</strong></font></p>
  <p><font size="2">2.- Para cambiar el nombre de un archivo tan solo ub&iacute;quelo
  en el Explorador de Windows haga UN click sobre el nombre del mismo y luego haga click otra vez, inmediatamente el nombre
  se
  convertir&aacute; en editable. Proceda modificar sus archivos de la manera que crea conveniente, siguiendo las sugerencias
  anteriores.&nbsp; </font></p>
  <p><font size="2">Es Muy importante saber <strong>qu&eacute; extension tienen
  su archivos</strong>, esto le dice que tipo de archivo es; la mayor&iacute;a de las veces basta con el iconito, pero este
  NO es el caso. </font></p>
  <p><font size="2"><strong>Para poder ver las extensiones de los archivos ( .JPG, .
  GIF, .PNG, ETC) haga
  lo
  siguiente:</strong></font></p>  <blockquote>
   <p><font size="2">a.- Vaya a &quot;Mi PC&quot;<br>
   b.- Vaya al men&uacute; &quot;herramientas&quot;, en ese men&uacute; seleccione el sub men&uacute; &quot;opciones de carpeta&quot;.
   Dentro de Opciones, busque la pesta&ntilde;a &quot;ver&quot;<br>
   c.- Busque las opciones &quot;ocultar las extensiones de archivo para tipos&nbsp; de acrhivo conocidos&quot;. <strong>DESHABIL&Iacute;TELA.</strong><br>
   d.- Presione &quot;Aceptar&quot;.</font></p>
  </blockquote>  <p><font size="2"><img src="opciones.jpg" width="708" height="468" border="1"> </font></p>
  <p><font size="2">Inmediatamente usted podr&aacute; ver que extensiones tienen los
  archivos que usted maneja. </font></p>
  <p><font size="2">3.- No todos los tipos de archivos son adecuados para la
  web. <strong>Procure Utilizar siempre archivos JPG o GIF</strong>, sobre todo si son fotos. <strong>No use archivos PNG,
  BMP, TIF, TGA, DOC, PPT</strong> (estos dos &uacute;ltimos NO son im&aacute;genes) ya que o son innecesariamente pesados
  o no son compatibles con el formato WEB. Recuerde que <strong>mientras menos pesen las im&aacute;genes,
  mejor</strong> para su servidor y sus usuarios, ya que la p&aacute;gina
  cargar&aacute;
  m&aacute;s r&aacute;pido.</font></p>
  <p><font size="2"><strong>4.- Para saber el peso de sus archivos:</strong></font></p>
  <p><font size="2">a.- en la barra del explorador, busque el men&uacute; &quot;ver&quot; y seleccione
  &quot; detalles.<br>
  <img src="detalles.jpg" width="158" height="236"> <br>
  </font></p>
  <p><font size="2">Inmediatamente usted podr&aacute; ver una lista de detalles del archivo entre las cuales se cneuntra el Tama&ntilde;o
  en Kbytes del mismo.<br>
  <img src="verdetalles.jpg" width="424" height="340" border="1">  </font></p>  <p>&nbsp;</p>
  <p><font size="2">Por lo general sus im&aacute;genes NO deber&iacute;an pesar m&aacute;s de 100
  K. si usted ve alguna imagen de m&aacute;s de 300 K, usted debe reducir el tama&ntilde;o de la misma. </font></p>  <p><font size="2">Para que tenga una idea, un CD ROM tiene una capacidad de
  700 MEGA Bytes. Un Mega byte son 1024 Kilo bytes. Una Imagen de 1 MEGA Byte deber&iacute;a ser <a href="imagen1mega.jpg" target="_blank" title="Ver una imagen de 1 MEGA">algo
  como esto</a>. ASI DE GRANDE es
  una im&aacute;gen de 1 Mega!!.. Si&nbsp; usted No necesita una imagen tan grande, usted NO debe subir a su Web site&nbsp; la
  im&aacute;gen en ese tama&ntilde;o. el manejar im&aacute;genes innecesariamente grandes solo le quitar&aacute; tiempo y agregar&aacute; furstraci&oacute;n
  a todas sus operaciones.</font></p>
  <p><font size="2">Esta Im&aacute;gen pesa 50 K!<br>
  <img src="imagen50K.jpg" width="640" height="480" border="1">  </font></p>
  <p><font size="2"><strong>El peso o Tama&ntilde;o de una im&aacute;gen lo dan b&aacute;sicamente 4 factores:</strong></font></p>
  <blockquote>
  <p><font size="2">1.- El formato: si es JPG tiende a pesar menos que si es
   BMP o PNG.<br>
   2.- El tama&ntilde;o real de la im&aacute;gen<br>
&oacute;n o densidad de la imagen ( se mide en DPI)<br>
4.- La calidad de compresi&oacute;n del formato&nbsp; JPG (mientras mayor calidad, menos peso y viceversa)</font></p>
  </blockquote>  <p>&nbsp;</p>
  <p>&nbsp;</p>
  <p><strong><font size="5">Editando las Im&aacute;genes</font></strong></p>  <p><font size="2"><strong>Ahora la pregunta &iquest; y c&oacute;mo le cambio el tama&ntilde;o a mis im&aacute;genes?. </strong></font></p>
  <p><font size="2"><strong>OLV&Iacute;DESE</strong> de PowerPoint, Word, Excel, el Visor de im&aacute;genes
  de windows, Picasa, el software de su c&aacute;mara de fotos, Etc. Esos programas NO son para modificar im&aacute;genes,
  si acaso son para ordenarlas. Usted necesita un EDITOR de Im&aacute;genes. No importa cuan sencillo sea, &eacute;ste debe
  tener las funciones b&aacute;sicas:
  Cambiar de Tama&ntilde;o, Cambiar de Resoluci&oacute;n y Recortar.</font></p>
  <p><font size="2">Le proveemos de un sencillo y gratuito editor de Im&aacute;genesk,
  libre de Virus y Spyware, llamado FREE IMAGE EDITOR para que usted descargue e Instale:</font></p>
  <p align="center"><font size="5"><a href="http://www.proyecto-internet.com/appz/editor-de-imagenes.exe" target="_blank"><strong>Editor
  de Im&aacute;genes <br>
  FREE IMAGE EDITOR (1.5MB)</strong></a></font></p>
  <p align="left"><font size="2">1.- Instale el software y abra la imagen que desea o necesita modificar con el mismo...</font></p>
  <p align="left"><font size="2">2.- Para modificar el tama&ntilde;o y resoluci&oacute;n de
  su imagen, busque el men&uacute; &quot;Raster&quot; y seleccione la opci&oacute;n &quot;Resample&quot;. Si su archivo tiene una resoluci&oacute;n
  mayor a 72 dpi este tendra un peso mayor innecesario. Entonces, primero <strong>cambie la resoluci&oacute;n a 72 dpi</strong> y
  luego seleccione&nbsp; el
  ancho que desea. (si usted va a subir una imagen peque&ntilde;a para un cat&aacute;logo de productos, por ejemplo, h&aacute;gala de 250 p&iacute;xeles
  de ancho, si va&nbsp; a
  subir una imagen grande, h&aacute;gala de 800 p&iacute;xeles de ancho). Im&aacute;genes de m&aacute;s de 1024 p&iacute;xeles
  son inutilmente grandes y pesadas.</font></p>
  <p align="left"><font size="2">&nbsp;<font color="#660000"><strong>ASEG&Uacute;RESE DE COLOCAR EL ZOOM A UN NIVEL DE 100% PARA VER EL TAMA&Ntilde;O
  REAL DE SU IMAGEN ORIGINAL.</strong></font></font></p>
  <p align="left"><font size="2">Al abrir la imagen en el editor podr&aacute; ver en la barra
  superior de la ventana los datos necesarios de su imagen: nombre, tama&ntilde;o profundidad y resoluci&oacute;n en dpi. <br>
  <img src="imageeditor1.jpg" width="758" height="584" border="1"> </font></p>
  <p align="left">&nbsp;</p>
  <p align="left"><font size="2">Al modificar el tama&ntilde;o usted ver&aacute; el resultado inmediatamente y obtendr&aacute; una imagen manejable y f&aacute;cil
  de transferir a su servidor.<br>
  <img src="imageeditor2.jpg" width="758" height="584"> </font></p>  <p align="left">&nbsp;</p>
  <p align="left"><font size="2">3.- Guarde la imagen con un nombre adecuado,
  considerando las sugerencias hechas al comienzo de este documento.<br>
  <img src="imageeditor3.jpg" width="802" height="460"> </font></p>  <p align="left">&nbsp;</p>
  <p align="left"><font size="2">Antes de guardar Presione el bot&oacute;n &quot;Avanzados&quot; y aseg&uacute;rese
  que la compresi&oacute;n sea entre el 50% y el 70% (mientras mayor porcentaje, MAYOR ser&aacute; el tama&ntilde;o de la im&aacute;gen;
  por lo general 50% es suficiente y adecuado)<br>
  <img src="imageeditor4.jpg" width="538" height="452"> </font></p>  <p align="left"><font size="2">Usted obtendr&aacute; una imagen lista para poder ser trabajda
  en su p&aacute;gina web. Aseg&uacute;rese de conservar los archivos originales en&nbsp; otra carpeta. confundirse es muy f&aacute;cil, sobre todo cuando la cantidad de im&aacute;genes es grande. S&oacute;lo&nbsp; el
  tener orden y m&eacute;todo le salvar&aacute;&nbsp; de perderse en la tarea y cometer errores inc&oacute;modos.</font></p></td>
</tr>
</table>
</body>
</html>
